class Card
    attr_reader :suit, :number, :cards, :value
    def initialize
        @suit = ["スペード", "ハート", "ダイヤ", "クラブ"]
        @number = (2..10).to_a + ['J', 'Q', 'K', 'A']#2からAまでを配列にする
        @cards = @suit.product(@number).map{|suit, number| "#{suit}の#{number}"} #上の2つの配列を組み合わせてトランプにする
        @value = { 
            "スペードのA" => 13, "スペードのK" => 12, "スペードのQ" => 11, "スペードのJ" => 10, "スペードの10" => 9, 
            "スペードの9" => 8, "スペードの8" => 7, "スペードの7" => 6, "スペードの6" => 5, "スペードの5" => 4, 
            "スペードの4" => 3, "スペードの3" => 2, "スペードの2" => 1, "ハートのA" => 13, "ハートのK" => 12, 
            "ハートのQ" => 11, "ハートのJ" => 10, "ハートの10" => 9, "ハートの9" => 8, "ハートの8" => 7, 
            "ハートの7" => 6, "ハートの6" => 5, "ハートの5" => 4, "ハートの4" => 3, "ハートの3" => 2, 
            "ハートの2" => 1, "ダイヤのA" => 13, "ダイヤのK" => 12, "ダイヤのQ" => 11, "ダイヤのJ" => 10, 
            "ダイヤの10" => 9, "ダイヤの9" => 8, "ダイヤの8" => 7, "ダイヤの7" => 6, "ダイヤの6" => 5, 
            "ダイヤの5" => 4, "ダイヤの4" => 3, "ダイヤの3" => 2, "ダイヤの2" => 1, "クラブのA" => 13, 
            "クラブのK" => 12, "クラブのQ" => 11, "クラブのJ" => 10, "クラブの10" => 9, "クラブの9" => 8, 
            "クラブの8" => 7, "クラブの7" => 6, "クラブの6" => 5, "クラブの5" => 4, "クラブの4" => 3, 
            "クラブの3" => 2, "クラブの2" => 1
        }

        # @value = { 
        #     "スペードの2" => 1, "スペードの3" => 2, "スペードの4" => 3, "スペードの5" => 4, "スペードの6" => 5, 
        #     "スペードの7" => 6, "スペードの8" => 7, "スペードの9" => 8, "スペードの10" => 9, "スペードのJ" => 10, 
        #     "スペードのQ" => 11, "スペードのK" => 12, "スペードのA" => 13, "ハートの2" => 1, "ハートの3" => 2, 
        #     "ハートの4" => 3, "ハートの5" => 4, "ハートの6" => 5, "ハートの7" => 6, "ハートの8" => 7, "ハートの9" => 8, 
        #     "ハートの10" => 9, "ハートのJ" => 10, "ハートのQ" => 11, "ハートのK" => 12, "ハートのA" => 13, 
        #     "ダイヤの2" => 1, "ダイヤの3" => 2, "ダイヤの4" => 3, "ダイヤの5" => 4, "ダイヤの6" => 5, "ダイヤの7" => 6, 
        #     "ダイヤの8" => 7, "ダイヤの9" => 8, "ダイヤの10" => 9, "ダイヤのJ" => 10, "ダイヤのQ" => 11, 
        #     "ダイヤのK" => 12, "ダイヤのA" => 13, "クラブの2" => 1, "クラブの3" => 2, "クラブの4" => 3, 
        #     "クラブの5" => 4, "クラブの6" => 5, "クラブの7" => 6, "クラブの8" => 7, "クラブの9" => 8, 
        #     "クラブの10" => 9, "クラブのJ" => 10, "クラブのQ" => 11, "クラブのK" => 12, "クラブのA" => 13} #気合ver.
    end
end


#     def value
#         @value = { "2" => 1, "3" => 2, "4" => 3, "5" => 4, "6" => 5, "7" => 6, "8" => 7, "9" => 8, "10" => 9, "J" => 10, "Q" => 11, "K" => 12, "A" => 13 }
    
#     end

# end