class Card
    attr_reader :suit, :number, :cards, :value
    def initialize
        @suit = ["スペード", "ハート", "ダイヤ", "クラブ"]
        @number = (2..10).to_a + ['J', 'Q', 'K', 'A']#2からAまでを配列にする
        @cards = @suit.product(@number).map{|suit, number| "#{suit}の#{number}"} #上の2つの配列を組み合わせてトランプにする
        @value ={ 
            "スペードのA" => 13, "スペードのK" => 12, "スペードのQ" => 11, "スペードのJ" => 10, "スペードの10" => 9, 
            "スペードの9" => 8, "スペードの8" => 7, "スペードの7" => 6, "スペードの6" => 5, "スペードの5" => 4, 
            "スペードの4" => 3, "スペードの3" => 2, "スペードの2" => 1, "ハートのA" => 13, "ハートのK" => 12, 
            "ハートのQ" => 11, "ハートのJ" => 10, "ハートの10" => 9, "ハートの9" => 8, "ハートの8" => 7, 
            "ハートの7" => 6, "ハートの6" => 5, "ハートの5" => 4, "ハートの4" => 3, "ハートの3" => 2, 
            "ハートの2" => 1, "ダイヤのA" => 13, "ダイヤのK" => 12, "ダイヤのQ" => 11, "ダイヤのJ" => 10, 
            "ダイヤの10" => 9, "ダイヤの9" => 8, "ダイヤの8" => 7, "ダイヤの7" => 6, "ダイヤの6" => 5, 
            "ダイヤの5" => 4, "ダイヤの4" => 3, "ダイヤの3" => 2, "ダイヤの2" => 1, "クラブのA" => 13, 
            "クラブのK" => 12, "クラブのQ" => 11, "クラブのJ" => 10, "クラブの10" => 9, "クラブの9" => 8, 
            "クラブの8" => 7, "クラブの7" => 6, "クラブの6" => 5, "クラブの5" => 4, "クラブの4" => 3, 
            "クラブの3" => 2, "クラブの2" => 1
        } #気合いver.

        # @value = {}
        # @suit.each do |suit|
        #     @number.each_with_index do |number, index|
        #         @value["#{suit}の#{number}"] = index + 1
        #     end
        # end　#シンプルver.→条件分岐で正しい値が出力されていない

    end
end
